       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO3.
      *  DEMO TO SHOW BASIC DATA TYPES, USER DEFINED WORDS, COBOL WORDS
      *
      * LEVEL NUMBER, DATA-NAME, PICTURE CLAUSE, VALUE, USAGE
      *    LEVEL NUMBERS ARE USED TO DIFFERENTIATE BETWEEN GRP AND IND V
      *    PIC CLAUSE SAYS DATA TYPE, SIGN, DECIMAL POINTS, LENGTH
      *    VALUE SAYS THE CONTENT OF THE VARIABLE.
      *    USAGE - HOW THE DATA IS STORED INSIDE
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-VARIBLES.
           05  WS-ALPHANUM PIC X(20)     VALUE 'SAMPLE DATA 123@#'.
           05  WS-ALPHABET PIC A(20)     VALUE 'SAMPLE DATA ONLY'.
           05  WS-NEW-ALPH PIC A(5)      VALUE  SPACES.
           05  WS-NUMERIC  PIC 9(5)      VALUE 12345.
           05  WS-DECIMAL  PIC 9(5).9(2) VALUE ZEROS.
           05  WS-IMPLICIT PIC 9(5)V9(2) VALUE 12345.55.
           05  WS-IMP-COMP3 PIC S9(5)V9(2) VALUE -12345.55 COMP-3.
           05  WS-CITY   PIC X(3).
               88  METRO   VALUES 'CHN','DEL','KOL','MUM'.
               88  NON-METRO VALUE SPACES.
       PROCEDURE DIVISION.
           DISPLAY "WS-ALPHANUM  :" WS-ALPHANUM.
           DISPLAY "WS-ALPHABET  :" WS-ALPHABET.
           INITIALIZE WS-ALPHABET
           DISPLAY "WS-ALPHABET  :" WS-ALPHABET.
           DISPLAY "WS-NUMERIC   :" WS-NUMERIC.
           MOVE WS-IMPLICIT TO WS-DECIMAL
           DISPLAY "WS-DECIMAL   :" WS-DECIMAL.
           DISPLAY "WS-IMPLICIT  :" WS-IMPLICIT.
           DISPLAY "WS-IMP-COMP3 :" WS-IMP-COMP3

           MOVE 'HYD' TO WS-CITY

           IF METRO
              DISPLAY 'METRO CITY'
           ELSE
              DISPLAY 'NON METRO CITY'
           END-IF.
           STOP RUN.
